import Layout from '@/app/layout'
import React from 'react'
import '../styles/global.scss'

export default function about() {
  return (
    <Layout>
      <main className='box flex-col'>
        <section>
            <h2>Про сайт</h2>
        <p>Цей сайт створено для мене, моїх друзів, знайомих та однодумців. Платформа створена не для збагачення, а для викладення моїх поглядів на туризм. 
          Я не веду підприємницьку діяльність у сфері туризму, а лиш маю за мету розширити коло людей з таким же світоглядом. 
          Звісно, Ви теж маєте особисту думку і вона може не збігатися з моєю. Тому я наголошую, що тут ви побачете лише моє суб'єктивне сприйняття, яке мене влаштовує без лишньої критики.
          Інформація, що подана на сайті точно не для всіх, тому аналізуйте та обдумуйте, перш ніж на неї полягатися. Всім добра!</p>
        </section>
        <section>
            <h2>Про мене</h2>
        <p>Я почав займатися туризмом у віці 12 років. Багато мандрував, займався хайкінгом, кемпінгом, бушкрафтингом, трекінгом, трейлранінгом, велоспортом, дещо автостопив та запрошував людей з собою.
          Таким чином я організовував різні заходи та обростав знайомствами. Увесь цей час я шукав багато нового в туризмі, здобував новий досвід в інших та ділився з ним. 
          Я не притендую на званя туристичного гуру, гіда, радника чи чогось подібного, а лише розвиваюсь як турист, розглядаючи різні авантюри. </p>
        </section><section>
            <h2>Про спорядження</h2>
        <p>Будучи дитиною, батьки мені придбали величезний наплічник. Туди вміщалось все, як і потрібні, так і безглузді речі. 
          Багато місця і страх, що я опинюсь в ситуації без необхідного спорядження підштовхували до думки напхати цей рюкзак сповна. 
          Несучи цей тягар на спині я отримував мало задоволеня. Зрештою, я вирішив облекшитись і з часом я відклав достатньо коштів щоб купити неякісний менший наплічник який порвався під час першої мандрівки. 
          Я був лише дитиною, але й досі пам'ятаю і важке, і неякісне спорядження. 
          Час минав, спорядження змінювалось, багато чого я побачив та спробував. І настав момент, коли у моєму асортименті одночасно було 11 рюкзаків, 8 наметів, 9 спальників і незліченна кількість іншого туристичного добра, але мені досі чогось нехватало. 
          Перші туристичні задуми я хотів реалізувати ще коли ходив до школи, я навіть накидав власні ескізи рюкзака, але у ті часи цікаві матеріали були важкодоступні. 
          У пошуках альтернативи я ще зіткнувся з проблемами виготовлення через велику кількість необхідного обладнання (для мене тоді було таємницею, що хороший рюкзак не вдастся пошити на звичайній машинці). 
          Проте, вдастся пошити чохли та гамаки. Від так, я розробив дві перші моделі гамака. З друзями скинулись грошима, я замовив матеріали і разом з мамою, відшили гамаки. 
          Не для продажу, а для друзів, звідси й назва "For Friends". Гамаки були дуже успішні, а цікаві матеріали стали доступніші. Виготовлення власного спорядження вимагає багатьох навиків, часу, терпіня та обладнання. 
          Рюкзаки якими я користувався вже були надто неактуальні, я обійшов усі магазини міста у пошуках нового ідеального наплічника, переглянув та спробував безліч варіантів, але сподобались мені лише два та й за їхню вартість, я міг би спробувати пошити щось для себе.
          Тому я продав багато свого спорядження та на заміну вирішив собі й друзям виготовити щось цікаве та й так як цього хочу я.
          Близько року, я розробляв собі рюкзак. Це було не на постійній основі, а лише коли приходило натхнення. Безліч раз я по-новому дивився на конструкцію, радився з туристами у яких значно більше досвіду, додавав та змінював деталі. 
          Багато чого запозичино з різних видів туризму. Вже й рюкзак перестав бути рюкзаком, а став подібний на жилет для бігу з каркасом та купою кріплень на спині. 
          Але через брак вільного часу пошивом зайнявся професіонал, а не я. Натомість, декілька тижнів, по-вечорах, я з другом сиділи над розробкою значно простішої моделі для нього. 
          І ось, він щасливо користується нею, а я продовжую спілукуватися з цікавими людьми, констроюю спорядження та допомагаю друзям. Ці вироби ви можете глянюти у розділі Gears.</p>
        </section><section>
            <h2>Про мандрівки</h2>
        <p>У розділі Trips, я не маю за мету давати настанови чи інструкції щодо маршрутів. За професією, я не гід, а людей кличу з собою лише для задоволення. Я мало фотографую та мало пишу, я не дбаю про естетику, а про багато своїх мандрівок я вже забув, тому постів не так багато. 
          Проте, в розповідях знайомі знаходять для себе корисну інформацію і лише заради експеременту я вирішив додати це на сайт.   
          Звісно, якщо Вам цікава моя думка, Ви можете зв'язатися зі мною та обговорити якісь деталі або покликати з собою, але я не даю гарантій, що я буду дбати про Ваш комфорт та якось скомпенсую складність мандрівки. Якщо зможу - допоможу, але розраховуйте на свої сили.</p>
        </section>
      </main>
    </Layout>
  )
}
