'use client'
import Head from 'next/head'
import Layout from '@/app/layout'
import React from 'react'
import '../styles/about.scss'

export default function About() {
  return (
    <>
      <Head>
        <title>Про сайт For Friends | Назар Сова</title>
        <meta
          name="description"
          content="Сайт створено Назаром Совою для друзів та однодумців. Тут ви знайдете інформацію про туризм, спорядження та мандрівки."
        />
        <meta
          name="keywords"
          content="For Friends, туризм, спорядження, мандрівки, Назар Сова"
        />
      </Head>
      <Layout>
        <main className="about-container responsive-container mx-auto p-6">
          <section className="section-card mb-8">
            <h2 className="section-title">Про сайт</h2>
            <p className="section-text">
              Цей сайт створено для мене, моїх друзів, знайомих та однодумців.
              Платформа створена не для збагачення, а для викладення моїх
              поглядів на туризм. Я не веду підприємницьку діяльність у сфері
              туризму, а лиш маю за мету розширити коло людей з таким же
              світоглядом. Звісно, Ви теж маєте особисту думку і вона може не
              збігатися з моєю. Тому я наголошую, що тут ви побачете лише моє
              суб&aposєктивне сприйняття, яке мене влаштовує без лишньої
              критики. Інформація, що подана на сайті точно не для всіх, тому
              аналізуйте та обдумуйте, перш ніж на неї полягатися. Всім добра!
            </p>
          </section>

          <section className="section-card mb-8">
            <h2 className="section-title">Про мене</h2>
            <p className="section-text">
              Я почав займатися туризмом у віці 12 років. Багато мандрував,
              займався хайкінгом, кемпінгом, бушкрафтингом, трекінгом,
              трейлранінгом, велоспортом, дещо автостопив та запрошував людей з
              собою. Таким чином я організовував різні заходи та обростав
              знайомствами. Увесь цей час я шукав багато нового в туризмі,
              здобував новий досвід в інших та ділився з ним. Я не притендую на
              званя туристичного гуру, гіда, радника чи чогось подібного, а лише
              розвиваюсь як турист, розглядаючи різні авантюри.{' '}
            </p>
          </section>

          <section className="section-card mb-8">
            <h2 className="section-title">Про спорядження</h2>
            <p className="section-text">
              За життя я спробував багато спорядження. Мій перший рюкзак був на
              сто літрів, потім я придбав собі менш якісний, який порвався вже
              під час першої мандрівки. Па&quotятаю ще старі брезентові намети,
              каркас яких робили з гілок, та багато іншого. Я спостерігав, як
              змінюється спорядження, як виробники створюють щось нове. Дехто
              робив революцію у світі туризму, а інші втрачали репутацію на
              довгі роки. Усі ці технології, конструкції, матеріали можуть
              звести з розуму. Хочеться все спробувати, побачити, відчути. Деякі
              речі вражають і надовго залишаються у колекції, але більшість не
              варті уваги. Незважаючи на це, у мене вже зібралося 11 рюкзаків, 7
              наметів, 8 спальників та незліченна кількість туристичного
              спорядження, яким я регулярно користувався. Але й цього не
              вистачало для повного задоволення моїх потреб. Я давно думав про
              створення власного спорядження і навіть зайнявся конструюванням
              гамаків під потреби друзів. Ми скинулися грошима, я замовив
              матеріали і пошив гамаки для друзів — звідси й назва &quotFor
              Friends&quot. Однак створити щось серйозне дійсно складно. Понад
              рік я розробляв спорядження, яке б краще задовольняло мої потреби,
              ніж те, що можна знайти в магазинах. Я шукав матеріали і вивчав,
              що роблять провідні бренди. І ось, на сторінці Gears ви можете
              побачити спорядження, яке я зробив сам.{' '}
            </p>
          </section>

          <section className="section-card mb-8">
            <h2 className="section-title">Про мандрівки</h2>
            <p className="section-text">
              У розділі Trips, я не маю за мету давати настанови чи інструкції
              щодо маршрутів. За професією, я не гід, а людей кличу з собою лише
              для задоволення. Я мало фотографую та мало пишу, я не дбаю про
              естетику, а про багато своїх мандрівок я вже забув, тому постів не
              так багато. Проте, в розповідях знайомі знаходять для себе корисну
              інформацію і лише заради експеременту я вирішив додати це на сайт.
              Звісно, якщо Вам цікава моя думка, Ви можете зв&aposязатися зі
              мною та обговорити якісь деталі або покликати з собою, але я не
              даю гарантій, що я буду дбати про Ваш комфорт та якось скомпенсую
              складність мандрівки. Якщо зможу - допоможу, але розраховуйте на
              свої сили.{' '}
            </p>
          </section>
        </main>
      </Layout>
    </>
  )
}
